package com.lit.data.skins

import com.lit.game.EntitySnaps.TYPE_PED
import com.lit.game.SnapShot
import com.lit.game.gui.donate.Donate
import com.lit.game.gui.donate.DonateItem
import com.lit.game.gui.treasure.TreasureItem
import com.lit.data.Rare

object Skins {
    val list = arrayOf(
        Skin("сиджей", 0, 999999),  // 1
        Skin("Хабиб", 0, 2500),  // 1
        Skin(" ", 16000, 1),  // 2
        Skin(" ", 42000, 4),  // 3
        Skin(" ", 50000, 5), // 4
        Skin("Бульдозер", 10000000, 5000),  // 5
        Skin("Неймар", 3000000, 300), // 6
        Skin(" ", 0),  // 7 стандартный
        Skin(" ", 0),  // 8 заключенный
        Skin(" ", 0),  // 9 скин бомжа регистрация
        Skin(" ", 0),  // 10 стандартный (бабушка)
        Skin(" ", 3000000, 300),  // 11 Девушка модная off-white
        Skin("Гамора", 0, 4000),  // 12 стандартный
        Skin(" ", 0),  // 13 шахтер женский
        Skin("Охра", 50000000, 50000, 0.0f, -0.7f),  // 14
        Skin("Некоглай", 2500000, 250), // 15 Некоглай
        Skin(" ", 0), // 16 Бомж при регистрации
        Skin(" ", 0), // 17 Скин АШ (можно будет потом в магаз закинуть)
        Skin(" ", 900000, 90), // 18 Шевченко в магазе одежды
        Skin(" ", 0), // 19 стандартный
        Skin(" ", 0), // 20 стандартный
        Skin(" ", 0), // 21 Охотник и рыбалка
        Skin(" ", 0), // 22 стандартный
        Skin(" ", 62000, 6), // 23 В магазе одежды
        Skin(" ", 350000, 35), // 24 в магазе одежды
        Skin(" ", 0), // 25 Зомби
        Skin(" ", 0), // 26 Охотница
        Skin(" ", 0), // 27 Шахтер
        Skin(" ", 0), // 28 Стандартный
        Skin(" ", 214000, 20), // 29 в рулетке падает
        Skin(" ", 350000, 35), // 30 в магазе одежды
        Skin(" ", 0), // 31 клуб женский
        Skin(" ", 0), // 32 стандартный
        Skin(" ", 1700000, 170), // 33 женский PornHub
        Skin(" ", 0), // 34 Шахтер
        Skin(" ", 400000, 40), // 35 в магазине одежды
        Skin(" ", 0), // 36 МЧС
        Skin(" ", 0), // 37 Крупье
        Skin(" ", 0), // 38 Стандартный
        Skin(" ", 0), // 39 Стандартный
        Skin("Снегурочка", 2500000, 2500),  // 40
        Skin(" ", 350_000, 100),  // 41 Голая Милашка
        Skin(" ", 0),  // 42 Челик с татухами (зек)
        Skin(" ", 0),  // 43 Работник нефтезавода
        Skin(" ", 0),  // 44 Работник завода
        Skin("Роналду", 2500000, 2500),  // 45
        Skin(" ", 0), // 46 Скин ОПГшника (Бат)
        Skin(" ", 0), // 47 Стандартный
        Skin(" ", 0), // 48 Большой Грут
        Skin(" ", 0), // 49 Стандартный Старик Кунг-Фу
        Skin(" ", 120000, 12), // 50 Мужской из магазина одежды
        Skin(" ", 300000, 30), // 51 Мужской из магазина одежды
        Skin(" ", 7500, 1), // 52 Мужской Адидас из магазина
        Skin(" ", 0), // 53 Стандартный
        Skin(" ", 0), // 54 Рабочий нефтезавода (женский)
        Skin(" ", 0), // 55 Правительство женский
        Skin(" ", 7500000, 750), // 56 Женский крутой с татухами
        Skin(" ", 375000, 37), // 57 из магазина одежды
        Skin(" ", 90000, 9), // 58 из магазина одежды
        Skin(" ", 0), // 59 Правительство мужской
        Skin(" ", 0), // 60 Рабочий мебельного завода (мужской)
        Skin(" ", 0), // 61 Мужской военный походу
        Skin(" ", 0), // 62 Стандартный дедушка
        Skin(" ", 0), // 63 Стандартный
        Skin(" ", 0), // 64 Стандартный женский вроде
        Skin(" ", 370000, 37), // 65 Женский Гучи
        Skin(" ", 220000, 22), // 66 Мужской из магазина
        Skin(" ", 10000, 1), // 67 Мужской из магазина
        Skin(" ", 600000, 60), // 68 Женский спортивный
        Skin(" ", 0), // 69 Рабочий мебельного (женский)
        Skin(" ", 0), // 70 Врач (мужской)
        Skin(" ", 15000000, 1500), // 71 Шейх
        Skin(" ", 0), // 72 Водитель мусоровоза (мужской)
        Skin(" ", 0), // 73 Лесничий женский походу
        Skin(" ", 0), // 74 Сиджей
        Skin(" ", 0), // 75 Инкоссатор (женский)
        Skin(" ", 70000, 7),  // 76 Женский из магазина
        Skin("Ведьма", 1500000, 1500),  // 77
        Skin(" ", 575000, 57),  // 78 Мужской из магазина
        Skin(" ", 0),  // 79 скин бомжа
        Skin(" ", 0),  // 80 инкоссатор (мужской)
        Skin(" ", 0),  // 81 Боксер стандартный
        Skin(" ", 400000, 40),  // 82 Мужской из магазина
        Skin(" ", 150000, 15),  // 83 мужской из магазина
        Skin(" ", 0),  // 84 сотрудник СМИ (мужской)
        Skin(" ", 4000000, 400),  // 85 девушка с ушками
        Skin("Пивозавр", 500000, 500),  //86 Пивозавр мужской
        Skin("Харли", 2500000, 2500),  // 87 Харли женский
        Skin(" ", 0),  // 88 стандартный спортивная бабушка
        Skin(" ", 0),  // 89 стандартный бабушка
        Skin(" ", 1000000, 100),  // 90 женский из магазина
        Skin("Школьница", 2500000, 2500),  // 91
        Skin(" ", 0),  // 92 на роликах женский - можно за донат продавать сразу с учетом роликов.
        Skin(" ", 0),  // 93 стандартный женский
        Skin("Крик", 2500000, 2500),  // 94
        Skin("Джейсон Вурхиз", 1500000, 1500),  // 95
        Skin(" ", 0),  // 96 военный
        Skin("Шрек", 20000000, 20000, 0.0f, -0.9f),  // 97
        Skin(" ", 3720000, 372),  // 98 мужской из магазина
        Skin(" ", 0),  // 99 на роликах мужской
        Skin(" ", 0),  // 100 Байкер
        Skin(" ", 0),  // 101 стандартный мужской депутат какой-то
        Skin(" ", 1500000, 150),  // 102 женскийх из магазина
        Skin(" ", 470000, 47),  // 103 женский из магазина
        Skin(" ", 35000, 3),  // 104 женский из магазина
        Skin(" ", 580000, 58),  // 105 мужской из магазина
        Skin(" ", 240000, 24),  // 106 мужской из магазина
        Skin(" ", 70000, 7),  // 107 мужской из магазина
        Skin(" ", 4000000, 400),  // 108 мужской из магазина
        Skin(" ", 270000, 27),  // 109 мужской из магазина
        Skin(" ", 200000, 20),  // 110 мужской из магазина
        Skin(" ", 0),  // 111 мужской скин ОПГ
        Skin(" ", 0),  // 112 мужской скин ОПГ
        Skin(" ", 5850, 1),  // 113 мужской из магазина
        Skin("Иван Золо", 2500000, 2500),  // 114
        Skin("Милохин", 2500000, 2500),  // 115
        Skin(" ", 5000000, 500),  // 116 мужской из магазина
        Skin(" ", 0),  // 117 террорист из КС Го
        Skin("Конор Макгрегор", 15000000, 1500),  // 118 Магрегор из магазина одежды
        Skin("Давидыч", 250000, 2500),  // 119
        Skin(" ", 22800000, 2200),  // 120 // из магазина одежды крутой скин
        Skin("Дед Мороз", 2500000, 2500),  // 121
        Skin(" ", 140000, 14),  // 122 мужской из магазина
        Skin(" ", 0),  // 123 мужской из ОПГ
        Skin("Амиран", 500000, 500),  // 124
        Skin(" ", 0),  // 125 стандартный женский
        Skin(" ", 0),  // 126 мужской из ОПГ
        Skin(" ", 1000),  // 127 стандартный
        Skin(" ", 0),  // 128 на коньках прикольный
        Skin(" ", 0),  // 129 стандартный бабушка
        Skin(" ", 0),  // 130 стандартный бабушка
        Skin(" ", 0),  // 131 женский ОПГ
        Skin("Кевин Один Дома", 8000000, 800),  // 132
        Skin(" ", 0),  // 133 женский доктор
        Skin(" ", 0),  // 134 скин бомжа
        Skin(" ", 0),  // 135 скин бомжа (Михаил)
        Skin(" ", 0),  // 136 скин бомжа (пни меня)
        Skin("Палпатин", 3600000, 3600),  // 137
        Skin("Пивозаворка", 500000, 500),  // 138
        Skin("Аниме тян", 3000000, 3000),  // 139
        Skin(" ", 0),  // 140 стандартный женский
        Skin(" ", 0),  // 141 стандартный женский
        Skin(" ", 0),  // 142 скин ОПГ Острые Козырьки
        Skin(" ", 0),  // 143 стандартный скин (таксист)
        Skin("Кавказец", 5000000, 500),  // 144
        Skin(" ", 0),  // 145 женский ОПГ
        Skin("Славянин", 5000000, 500),  // 146
        Skin(" ", 0),  // 147 сотрудник ГИБДД
        Skin(" ", 0),  // 148 врач (женский)
        Skin(" ", 0),  // 149 Биг Смоук с бронежилетом
        Skin(" ", 0),  // 150 стандартный адвокат (женский)
        Skin(" ", 0),  // 151 Деливери доставка (женский)
        Skin(" ", 0),  // 152 Яндекс доставка (женский)
        Skin(" ", 0),  // 153 стандартный
        Skin("FACE", 2500000, 2500),  // 154
        Skin(" ", 0),  // 155 Деливер доставка (мужской)
        Skin(" ", 0),  // 156 стандартный старик
        Skin(" ", 0),  // 157 стандартный женский
        Skin("Каха", 1500000, 1500),  // 158
        Skin("Литвин", 2500000, 2500),  // 159
        Skin(" ", 0),  // 160 скин бомжа
        Skin("Месси", 2500000, 2500),  // 161
        Skin(" ", 0),  // 162 скин фермера
        Skin(" ", 0),  // 163 стажер ФСБ (мужской)
        Skin(" ", 0),  // 164 скин ФСБ (мужской)
        Skin(" ", 0),  // 165 скин ФСБ (женский)
        Skin(" ", 0),  // 166 скин ОМОН (мужской)
        Skin(" ", 0),  // 167 Яндекс доставка (мужской)
        Skin("Доминик Торетто", 1500000, 1500),  // 168
        Skin(" ", 340000, 340),  // 169 женский из магаза вроде
        Skin("Серго", 1500000, 1500),  // 170
        Skin("Бустер", 5000000, 5000),  // 171
        Skin(" ", 0),  // 172 стажер ФСБ (женский)
        Skin(" ", 0),  // 173 сотрудник ФСБ (мужской)
        Skin(" ", 0),  // 174 ОМОН ФСБ (мужской)
        Skin(" ", 0),  // 175 Директор ФСБ (мужской)
        Skin("Мужик", 2750000, 275),  // 176 мужской из магазина
        Skin("Пацан", 3500),  // 177 мужской из магазина
        Skin("Карнавал", 10000000, 1000), // 178 женский из магазина
        Skin(" ", 0),  // 179 военный для ВМФ
        Skin(" ", 180000, 18),  // 180 мужской из магазина
        Skin(" ", 0), // 181 байкер крутой
        Skin(" ", 0), // 182 стандартный
        Skin("Лунный рыцарь", 0, 15_000), // 183 стандартный
        Skin("Админ", 30000000, 15_000), // 184
        Skin(" ", 670000, 67), // 185 из магазина мужской
        Skin("Флеш", 10000000, 10000), // 186
        Skin(" ", 0), // 187 Охрана правительства (Мужской)
        Skin(" ", 850000, 85), // 188 женский из магазина
        Skin(" ", 0), // 189 // менеджер казино (мужской)
        Skin(" ", 800000, 80), // 190 женский из магазина
        Skin(" ", 0), // 191 Женский ВМФ
        Skin("Ева", 15000000, 1500), // 192
        Skin(" ", 0), // 193 женский вроде ОПГ
        Skin(" ", 0), // 194 женский крупье
        Skin(" ", 0), // 195 женский вроде опг
        Skin(" ", 0), // 196 стандартный бабушка
        Skin(" ", 0), // 197 стандартный фермерша
        Skin(" ", 2500000, 250), // 198 бабушка из магазина
        Skin(" ", 0), // 199 стандартный (старушка)
        Skin(" ", 0), // 200 скин бомжа (Акакий)
        Skin(" ", 2000000, 200), // 201 женский зимний
        Skin(" ", 0), // 202 мужской
        Skin(" ", 0), // 203 мужской тренер ушу
        Skin(" ", 0), // 204 мужской тренер ушу
        Skin(" ", 0), // 205 стандартный бургер (женский)
        Skin("Сорвиголова", 75000000, 7500),  // 206
        Skin(" ", 0),  // 207 стандартный женский
        Skin("Бодров", 2500000, 2500),  // 208
        Skin(" ", 0),  // 209 стандартный доставщик
        Skin(" ", 0),  // 210 стандартный мужской
        Skin(" ", 0),  // 211 сотрудник МВД (мужской)
        Skin(" ", 0),  // 212 в пиджаке Босс (мужской)
        Skin(" ", 0),  // 213 в пиджаке мужской
        Skin(" ", 3000000, 300),  // 214 спортивный женский (в магаз надо его)
        Skin(" ", 0),  // 215 стандартный женский
        Skin(" ", 0),  // 216 стандартный женский
        Skin(" ", 0),  // 217 сотрудник СМИ (мужской)
        Skin(" ", 0),  // 218 стандартный (бабушка)
        Skin("Алая ведьма", 0, 15_000),  // 219 стандартный медик (женский)
        Skin("Северус", 1500000, 1500),  // 220
        Skin("Детстроук", 15000000, 15000),  // 221
        Skin(" ", 0), // 222 мужской Босс
        Skin(" ", 0), // 223 мужской острые козырьки
        Skin(" ", 0), // 224 женский якудза
        Skin(" ", 75_000, 10), // 225 женский хз кто
        Skin("Квин", 3600000, 3600), // 226
        Skin("Крюгер", 2500000, 2500), // 227
        Skin("Пабло", 2500000, 2500), // 228
        Skin(" ", 0), // 229 мужской стандартный
        Skin(" ", 200_000, 40), // 230 скин бомжа прикольный в кросах
        Skin(" ", 0), // 231 скин бомжики
        Skin(" ", 0), // 232 скин бомжики
        Skin(" ", 1000000, 100), // 233 женский скин в магазине вроде
        Skin(" ", 0), // 234 скин новичка
        Skin(" ", 0), // 235 скин бомжа
        Skin(" ", 0), // 236 скин бомжа
        Skin(" ", 700000, 70), // 237 женский из магазина
        Skin("Дафна", 2000000, 2000), // 238
        Skin(" ", 0), // 239 скин новичка
        Skin(" ", 0), // 240 скин автошкольника (мужской)
        Skin(" ", 0), // 241 скин толстяка стандартный
        Skin(" ", 0), // 242 скин пузатика
        Skin(" ", 0), // 243 скин стандартный
        Skin(" ", 0), // 244 скин проститутки
        Skin(" ", 2500), // 245 скин милфы
        Skin(" ", 0), // 246 скин проститутки
        Skin(" ", 0), // 247 скин байкера
        Skin(" ", 0), // 248 скин байкера
        Skin(" ", 0), // 249 скин обезъяны
        Skin(" ", 0), // 250 скин первый канал
        Skin(" ", 0), // 251 стандартный женский
        Skin(" ", 0), // 252 стандартный в трусах
        Skin(" ", 0), // 253 Томас Шелби
        Skin(" ", 0), // 254 Байкер
        Skin(" ", 0), // 255 ВМВ майор
        Skin(" ", 0), // 256 скин проститутки
        Skin(" ", 0), // 257 скин проститутки
        Skin(" ", 300000, 30), // 258 Мальборо
        Skin(" ", 0), // 259 Колян
        Skin(" ", 0), // 260 Вован
        Skin(" ", 0), // 261 Антоха
        Skin(" ", 0), // 262 стандартный пьяница
        Skin(" ", 0), // 263 водитель мусоровоза (женский)
        Skin("Пеннивайз", 3600000, 3600), // 264
        Skin(" ", 400000, 40), // 265 мужской из магазина
        Skin(" ", 0), // 266 сотрудник МВД
        Skin("Агент 007", 2500000, 2500), // 267
        Skin(" ", 0), // 268 скин заключенного Авторитет
        Skin(" ", 0), // 269 Биг Смоук
        Skin(" ", 5000000, 500), // 270 скин солидный мужской
        Skin(" ", 3000000, 300), // 271 Скин мусульманина
        Skin("Человек Паук", 20000000, 20000), // 272
        Skin("Скелетон", 10000000, 10000), // 273
        Skin(" ", 0), // 274 сотрудник больницы
        Skin(" ", 0), // 275 сотрудник больницы (мужской)
        Skin(" ", 0), // 276 сотрудник больницы (главрач)
        Skin(" ", 0), // 277 тушит пожар (мужской)
        Skin(" ", 0), // 278 тушит пожар (мужской)
        Skin(" ", 0), // 279 тушит пожар (мужской)
        Skin(" ", 0), // 280 сотрудник МВД (генерал)
        Skin(" ", 0), // 281 сотрудник ГИБДД (Мужской)
        Skin(" ", 0), // 282 сотрудник ОМОН (мужской)
        Skin(" ", 0), // 283 сотрудник МВД (лейтенант)
        Skin(" ", 0), // 284 сотрудник МВД (мужской)
        Skin(" ", 0), // 285 сотрудник МВД (генерал)
        Skin(" ", 0), // 286 сотрудник ГИБДД
        Skin(" ", 0), // 287 мужской в комуфляже
        Skin(" ", 0), // 288 сотрудник ВМФ (военный)
        Skin("Егор Крид", 3500000, 350), // 289
        Skin(" ", 2730000, 273),  // 290 мужской из магазина
        Skin("Нигга", 5000000, 50), // 291
        Skin("Вован", 7000000, 500), // 292
        Skin(" ", 6850000, 680), // 293 мужской из магазина
        Skin("Моргенштерн", 2500000, 2500), // 294
        Skin(" ", 0), // 295 мужской генерал СВ
        Skin("Кизару", 2500000, 2500), // 296
        Skin("Оксимирон", 5000000, 5000), // 297
        Skin("Димитреску", 6000000, 6000), // 298
        Skin("Мияги", 2500000, 2500), // 299
        Skin(" ", 0), // 300 сотрудник МВД
        Skin(" ", 0), // 301 военный
        Skin(" ", 0), // 302 военный
        Skin(" ", 0), // 303 военный
        Skin(" ", 5000000, 5000), // 304 Бригада
        Skin(" ", 5000000, 5000), // 305 Бригада
        Skin(" ", 0), // 306 женский непонятный
        Skin(" ", 0), // 307 женский непонятный
        Skin(" ", 0), // 308 женский непонятный
        Skin(" ", 0), // 309 женский непонятный
        Skin(" ", 5000000, 5000), // 310 Саня Белый
        Skin(" ", 5000000, 5000), // 311 Бригада
    )

//    @JvmStatic
//    @SuppressLint("DefaultLocale")
//    fun getResource(skinId: Int): Int {
//        val str = String.format("skin_%d", skinId)
//        return Samp.activity.resources.getIdentifier(str, "drawable", Samp.activity.packageName)
//    }

    @JvmStatic
    fun getName(skinId: Int): String {
        if(" " == list[skinId].name)
            return "Скин $skinId"

        return list[skinId].name
    }

    fun getRare(skinId: Int): Int {
        return Rare.getRareFromPrice(getPriceLC(skinId))
    }

    fun getPriceRub(skinId: Int): Int {
        return list[skinId].priceRub
    }

    private fun getXOffset(skinId: Int): Float {
        return list[skinId].xOffset
    }

    private fun getYOffset(skinId: Int): Float {
        return list[skinId].yOffset
    }

    private fun getZOffset(skinId: Int): Float {
        return list[skinId].zOffset
    }

    @JvmStatic
    fun getPriceLC(skinId: Int): Int {
        return list[skinId].priceLC
    }

    fun getSnap(modelId: Int): SnapShot {
        return SnapShot(TYPE_PED, modelId, 0f, 180f, 0f, getXOffset(modelId), getYOffset(modelId), getZOffset(modelId))
    }

    fun createDonateItem(modelId: Int): DonateItem {
        return DonateItem(
                getName(modelId),
                Donate.CATEGORY_SKINS,
                getPriceLC(modelId),
                modelId,
                getSnap(modelId)
            )
    }

    fun createTreasureItem(modelId: Int): TreasureItem {
        return TreasureItem(
            SnapShot(TYPE_PED, modelId, 0f, 180f, 0f, getXOffset(modelId), getYOffset(modelId), getZOffset(modelId)),
            getName(modelId),
            getRare(modelId)
        )
    }
}